In [1]:
import pandas as pd
dict1={
    'Name':['Priyang','Aadhya','Krishna','Vedant','Parahv','Mittal','Archana'],
    'Marks':[98,89,99,87,90,83,82]
}
df1=pd.DataFrame(dict1)
df1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2  Krishna     99
3   Vedant     87
4   Parahv     90
5   Mittal     83
6  Archana     82

# Add Column

In [4]:
df1["Grade"]=["A","B","C","D","E","F","G"]

# Drop Column

In [8]:
df1.drop("Grade",axis="columns",inplace=True)

In [10]:
df1["Grade"]=["A","B","C","D","E","F","G"]
df1["Grade2"]=["A","B","C","D","E","F","G"]

In [13]:
df1.drop(["Grade","Grade2"],axis="columns",inplace=True)

In [23]:
df1.drop(columns=df1.columns[2:3],inplace=True)
df1

      Name Grade3  Marks
2  Krishna      C     99
3   Vedant      D     87
4   Parahv      E     90
5   Mittal      F     83
6  Archana      G     82

In [ ]:
Drop Rows

In [19]:
df1.drop([0,1],inplace=True)
df1

      Name Grade3 Grade  Marks
2  Krishna      C     C     99
3   Vedant      D     D     87
4   Parahv      E     E     90
5   Mittal      F     F     83
6  Archana      G     G     82

In [20]:
df1.drop(index=range(4,6))

      Name Grade3 Grade  Marks
2  Krishna      C     C     99
3   Vedant      D     D     87
6  Archana      G     G     82

# insert

In [18]:
l1=["A","B","C","D","E","F","G"]
df1.insert(1,"Grade3",l1)
df1

      Name Grade3 Grade  Marks
0  Priyang      A     A     98
1   Aadhya      B     B     89
2  Krishna      C     C     99
3   Vedant      D     D     87
4   Parahv      E     E     90
5   Mittal      F     F     83
6  Archana      G     G     82

#

In [25]:
df1.loc[7]=["Raju","I",90]
df1

      Name Grade3  Marks
2  Krishna      C     99
3   Vedant      D     87
4   Parahv      E     90
5   Mittal      F     83
6  Archana      G     82
7     Raju      I     90

# Remove Rows based on condition

In [29]:
s=df1[df1["Marks"]>90]
df1.drop(s.index,inplace=True)

In [30]:
df1

      Name Grade3  Marks
3   Vedant      D     87
4   Parahv      E     90
5   Mittal      F     83
6  Archana      G     82
7     Raju      I     90

# Update particular column data

In [42]:
df1[df1["Name"]=="Raju"]=["Raju","H",100]

In [41]:
df1

      Name Grade3  Marks
3   Vedant      D     87
4   Parahv      E     90
5   Mittal      F     83
6  Archana      G     82
7      100    100    100